Revit 2027 API
SynchronizeWithCentralOptions.SaveLocalBefore Property
 True means to save local before the first reload latest if there are changes not yet saved to local. True by default. Silently ignored if the model in the current session is central rather than local.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SaveLocalBefore { get; set; }
Public Property SaveLocalBefore As Boolean
	Get
	Set
public:
property bool SaveLocalBefore {
	bool get ();
	void set (bool value);
}
member SaveLocalBefore : bool with get, set
Property Value
Boolean
See Also
Reference
SynchronizeWithCentralOptions Class
Autodesk.Revit.DB Namespace